{
  "serenity": {
    "id": "serenity",
    "label": {
      "ro": "seninătate",
      "en": "serenity"
    },
    "description": {
      "ro": "Seninatatea este forma blanda a bucuriei — o liniste interioara calda care apare cand nu exista amenintari si te simti in siguranta. Este starea de echilibru in care mintea se opreste din cautare si corpul se relaxeaza. Seninatatea nu este absenta emotiilor, ci prezenta unei acceptari profunde a momentului prezent.",
      "en": "Serenity is the gentle form of joy — a warm inner stillness that arises when there are no threats and you feel safe. It is the state of balance where the mind stops searching and the body relaxes. Serenity is not the absence of emotions, but the presence of a deep acceptance of the present moment."
    },
    "needs": {
      "ro": "prezenta si savurare",
      "en": "presence and savoring"
    },
    "category": "intensity",
    "color": "#FFF59D",
    "intensity": 0.3,
    "opposite": "pensiveness",
    "spawns": [
      "joy",
      "acceptance",
      "love"
    ]
  },
  "ecstasy": {
    "id": "ecstasy",
    "label": {
      "ro": "extaz",
      "en": "ecstasy"
    },
    "description": {
      "ro": "Extazul este forma cea mai intensa a bucuriei — o stare de euforie coplesitoare in care simti ca depasesti limitele sinelui obisnuit. Poate aparea in momente de realizare extraordinara, conexiune profunda sau experienta spirituala. Desi puternic si transformator, extazul este tranzitoriu prin natura sa si nu poate fi sustinut indefinit.",
      "en": "Ecstasy is the most intense form of joy — an overwhelming state of euphoria where you feel you transcend the boundaries of your ordinary self. It can arise in moments of extraordinary achievement, deep connection, or spiritual experience. Though powerful and transformative, ecstasy is transient by nature and cannot be sustained indefinitely."
    },
    "needs": {
      "ro": "ancorare si partajare",
      "en": "grounding and sharing"
    },
    "category": "intensity",
    "color": "#FFD700",
    "intensity": 0.8,
    "opposite": "grief",
    "spawns": [
      "joy",
      "admiration",
      "optimism"
    ]
  },
  "acceptance": {
    "id": "acceptance",
    "label": {
      "ro": "acceptare",
      "en": "acceptance"
    },
    "description": {
      "ro": "Acceptarea este forma calma a increderii — disponibilitatea de a primi ceea ce este fara a incerca sa schimbi. Nu inseamna resemnare sau pasivitate, ci recunoasterea lucida a realitatii. In terapie, acceptarea este adesea punctul de turnura: cand renunti la lupta cu ceea ce nu poti controla, energia ta se elibereaza pentru ceea ce poti schimba.",
      "en": "Acceptance is the calm form of trust — the willingness to receive what is without trying to change it. It does not mean resignation or passivity, but the clear recognition of reality. In therapy, acceptance is often the turning point: when you stop fighting what you cannot control, your energy is freed for what you can change."
    },
    "needs": {
      "ro": "liniste si rabdare",
      "en": "stillness and patience"
    },
    "category": "intensity",
    "color": "#C8F7DC",
    "intensity": 0.3,
    "opposite": "boredom",
    "spawns": [
      "trust",
      "serenity",
      "submission"
    ]
  },
  "admiration": {
    "id": "admiration",
    "label": {
      "ro": "admirație",
      "en": "admiration"
    },
    "description": {
      "ro": "Admiratia este forma intensa a increderii — o recunoastere profunda a valorii celuilalt care te inspira si te motiveaza. Este emotia care sta la baza mentoratului si a invatarii. Admiratia sanatoasa nu diminueaza propria valoare, ci iti arata directia in care poti creste. Devine problematica doar cand se transforma in idealizare.",
      "en": "Admiration is the intense form of trust — a deep recognition of another's value that inspires and motivates you. It is the emotion that underlies mentorship and learning. Healthy admiration does not diminish your own worth, but shows you the direction in which you can grow. It becomes problematic only when it turns into idealization."
    },
    "needs": {
      "ro": "inspiratie si crestere personala",
      "en": "inspiration and self-growth"
    },
    "category": "intensity",
    "color": "#7DD9A8",
    "intensity": 0.8,
    "opposite": "loathing",
    "spawns": [
      "trust",
      "ecstasy",
      "love"
    ]
  },
  "apprehension": {
    "id": "apprehension",
    "label": {
      "ro": "îngrijorare",
      "en": "apprehension"
    },
    "description": {
      "ro": "Ingrijorarea este forma usoara a fricii — un semnal subtil ca ceva ar putea merge prost. Este mintea ta care scaneaza orizontul pentru potentiale probleme. In doze mici, este utila si adaptativa, ajutandu-te sa te pregatesti. Devine dificila cand se transforma in ruminatie constanta despre scenarii care probabil nu se vor intampla.",
      "en": "Apprehension is the mild form of fear — a subtle signal that something might go wrong. It is your mind scanning the horizon for potential problems. In small doses, it is useful and adaptive, helping you prepare. It becomes difficult when it turns into constant rumination about scenarios that will probably never happen."
    },
    "needs": {
      "ro": "reasigurare si ancorare",
      "en": "reassurance and grounding"
    },
    "category": "intensity",
    "color": "#A8E8C8",
    "intensity": 0.3,
    "opposite": "annoyance",
    "spawns": [
      "fear",
      "acceptance",
      "awe"
    ]
  },
  "terror": {
    "id": "terror",
    "label": {
      "ro": "teroare",
      "en": "terror"
    },
    "description": {
      "ro": "Teroarea este forma extrema a fricii — o stare de panica totala in care corpul preia controlul si mintea rationala se deconecteaza. Sistemul nervos intra in suprasolicitare, pregatindu-te pentru supravietuire imediata. Este raspunsul la amenintari percepute ca fiind de viata si de moarte, chiar daca uneori amenintarea nu este reala.",
      "en": "Terror is the extreme form of fear — a state of total panic where the body takes control and the rational mind disconnects. The nervous system enters overload, preparing you for immediate survival. It is the response to threats perceived as life-or-death, even when sometimes the threat is not real."
    },
    "needs": {
      "ro": "siguranta imediata si co-reglare",
      "en": "immediate safety and co-regulation"
    },
    "category": "intensity",
    "color": "#68C898",
    "intensity": 0.8,
    "opposite": "rage",
    "spawns": [
      "fear",
      "amazement",
      "submission"
    ]
  },
  "distraction": {
    "id": "distraction",
    "label": {
      "ro": "distragere",
      "en": "distraction"
    },
    "description": {
      "ro": "Distragerea este forma usoara a surprinderii — o deviere temporara a atentiei cauzata de un stimul neasteptat. Mintea ta isi intrerupe cursul curent pentru a evalua noutatea. In viata moderna, distragerea constanta poate eroda capacitatea de concentrare si prezenta, dar in sine este un mecanism adaptativ care te ajuta sa detectezi schimbarile din mediu.",
      "en": "Distraction is the mild form of surprise — a temporary diversion of attention caused by an unexpected stimulus. Your mind interrupts its current course to evaluate the novelty. In modern life, constant distraction can erode your capacity for focus and presence, but in itself it is an adaptive mechanism that helps you detect changes in your environment."
    },
    "needs": {
      "ro": "concentrare si redirectionare blanda",
      "en": "focus and gentle redirection"
    },
    "category": "intensity",
    "color": "#A8E8FF",
    "intensity": 0.3,
    "opposite": "interest",
    "spawns": [
      "surprise",
      "apprehension",
      "disapproval"
    ]
  },
  "amazement": {
    "id": "amazement",
    "label": {
      "ro": "uimire",
      "en": "amazement"
    },
    "description": {
      "ro": "Uimirea este forma intensa a surprinderii — o stare de soc pozitiv in care mintea se opreste complet, coplesita de magnitudinea a ceea ce percepe. Este emotia care deschide usa catre veneratie si respect profund. Uimirea iti reaminteste ca lumea este mai vasta si mai complexa decat modelele tale mentale obisnuite.",
      "en": "Amazement is the intense form of surprise — a state of positive shock where the mind stops completely, overwhelmed by the magnitude of what it perceives. It is the emotion that opens the door to awe and deep respect. Amazement reminds you that the world is vaster and more complex than your usual mental models."
    },
    "needs": {
      "ro": "liniste si integrare",
      "en": "stillness and integration"
    },
    "category": "intensity",
    "color": "#5FC8E8",
    "intensity": 0.8,
    "opposite": "vigilance",
    "spawns": [
      "surprise",
      "terror",
      "awe"
    ]
  },
  "pensiveness": {
    "id": "pensiveness",
    "label": {
      "ro": "melancolie",
      "en": "pensiveness"
    },
    "description": {
      "ro": "Melancolia este forma subtila a tristetii — o nostalgie calda amestecata cu reflectie. Nu doare acut, ci pluteste ca o ceata usoara peste constiinta ta. Este starea in care iti amintesti ce a fost si contempli trecerea timpului. Melancolia poate fi o poarta catre intelegere profunda si creativitate, daca nu te pierzi in ea.",
      "en": "Pensiveness is the subtle form of sadness — a warm nostalgia mixed with reflection. It doesn't hurt acutely, but floats like a gentle mist over your consciousness. It is the state where you remember what was and contemplate the passage of time. Pensiveness can be a gateway to deep understanding and creativity, if you don't lose yourself in it."
    },
    "needs": {
      "ro": "companie blanda si reflectie",
      "en": "gentle company and reflection"
    },
    "category": "intensity",
    "color": "#85C1E9",
    "intensity": 0.3,
    "opposite": "serenity",
    "spawns": [
      "sadness",
      "distraction",
      "remorse"
    ]
  },
  "grief": {
    "id": "grief",
    "label": {
      "ro": "durere",
      "en": "grief"
    },
    "description": {
      "ro": "Durerea este forma cea mai intensa a tristetii — o suferinta profunda care apare dupa pierderi majore. Corpul si mintea sunt complet absorbite de absenta a ceea ce a fost. Durerea nu se vindeca liniar, ci vine in valuri. Nu exista un mod corect de a suferi — procesul tau este unic, si vindecarea inseamna integrare, nu uitare.",
      "en": "Grief is the most intense form of sadness — a profound suffering that arises after major losses. Body and mind are completely absorbed by the absence of what was. Grief does not heal linearly, but comes in waves. There is no correct way to grieve — your process is unique, and healing means integration, not forgetting."
    },
    "needs": {
      "ro": "sprijin, timp si martori",
      "en": "support, time, and witness"
    },
    "category": "intensity",
    "color": "#3498DB",
    "intensity": 0.8,
    "opposite": "ecstasy",
    "spawns": [
      "sadness",
      "loathing",
      "disapproval"
    ]
  },
  "boredom": {
    "id": "boredom",
    "label": {
      "ro": "plictiseală",
      "en": "boredom"
    },
    "description": {
      "ro": "Plictiseala este forma usoara a dezgustului — un dezinteres subtil care semnaleaza ca stimularea actuala nu iti satisface nevoile. Este un semnal important ca ceva trebuie sa se schimbe — fie activitatea, fie perspectiva ta. Plictiseala poate fi un catalizator al creativitatii si schimbarii daca o asculti, sau o sursa de comportamente disfunctionale daca o ignori.",
      "en": "Boredom is the mild form of disgust — a subtle disinterest signaling that current stimulation doesn't meet your needs. It is an important signal that something needs to change — either the activity or your perspective. Boredom can be a catalyst for creativity and change if you listen to it, or a source of dysfunctional behaviors if you ignore it."
    },
    "needs": {
      "ro": "stimulare si sens",
      "en": "stimulation and meaning"
    },
    "category": "intensity",
    "color": "#D2B4DE",
    "intensity": 0.3,
    "opposite": "acceptance",
    "spawns": [
      "disgust",
      "pensiveness",
      "contempt"
    ]
  },
  "loathing": {
    "id": "loathing",
    "label": {
      "ro": "scârbă",
      "en": "loathing"
    },
    "description": {
      "ro": "Scarba este forma extrema a dezgustului — o respingere viscerala si totala a ceea ce percepi ca profund gresit sau contaminant. Corpul reactioneaza puternic, cu greata si retragere. Scarba functioneaza ca o bariera de protectie maxima, dar cand este indreptata catre propria persoana, devine auto-distructiva si necesita atentie terapeutica.",
      "en": "Loathing is the extreme form of disgust — a visceral and total rejection of what you perceive as profoundly wrong or contaminating. The body reacts strongly, with nausea and withdrawal. Loathing functions as a maximum protective barrier, but when directed toward yourself, it becomes self-destructive and requires therapeutic attention."
    },
    "needs": {
      "ro": "distanta si auto-compasiune",
      "en": "distance and self-compassion"
    },
    "category": "intensity",
    "color": "#9B59B6",
    "intensity": 0.8,
    "opposite": "admiration",
    "spawns": [
      "disgust",
      "grief",
      "remorse"
    ]
  },
  "annoyance": {
    "id": "annoyance",
    "label": {
      "ro": "iritare",
      "en": "annoyance"
    },
    "description": {
      "ro": "Iritarea este forma usoara a furiei — o frustrare de suprafata care apare cand lucrurile mici nu merg asa cum vrei. Este un semnal timpuriu ca o limita personala este testata sau ca o nevoie nu este satisfacuta. Iritarea repetata merita atentie — adesea ascunde emotii mai profunde precum oboseala, dezamagirea sau sentimentul de neapreciere.",
      "en": "Annoyance is the mild form of anger — a surface frustration that arises when small things don't go your way. It is an early signal that a personal boundary is being tested or a need is unmet. Repeated annoyance deserves attention — it often hides deeper emotions like fatigue, disappointment, or feeling unappreciated."
    },
    "needs": {
      "ro": "recunoastere si mici ajustari",
      "en": "acknowledgment and small adjustments"
    },
    "category": "intensity",
    "color": "#FF9999",
    "intensity": 0.3,
    "opposite": "apprehension",
    "spawns": [
      "anger",
      "boredom",
      "aggression"
    ]
  },
  "rage": {
    "id": "rage",
    "label": {
      "ro": "mânie",
      "en": "rage"
    },
    "description": {
      "ro": "Mania este forma cea mai intensa a furiei — o explozie emotionala in care simti ca trebuie sa distrugi obstacolul, indiferent de consecinte. Corpul se inunda cu adrenalina, gandirea se ingusteaza si capacitatea de empatie dispare temporar. Mania cronica indica adesea rani vechi nerezolvate si necesita un spatiu sigur pentru a fi explorata si integrata.",
      "en": "Rage is the most intense form of anger — an emotional explosion where you feel you must destroy the obstacle, regardless of consequences. The body floods with adrenaline, thinking narrows, and the capacity for empathy temporarily disappears. Chronic rage often indicates unresolved old wounds and requires a safe space to be explored and integrated."
    },
    "needs": {
      "ro": "containment si eliberare sigura",
      "en": "containment and safe release"
    },
    "category": "intensity",
    "color": "#E74C3C",
    "intensity": 0.8,
    "opposite": "terror",
    "spawns": [
      "anger",
      "vigilance",
      "contempt"
    ]
  },
  "interest": {
    "id": "interest",
    "label": {
      "ro": "interes",
      "en": "interest"
    },
    "description": {
      "ro": "Interesul este forma calma a anticiparii — o curiozitate calda care te atrage catre ceva nou fara urgenta. Este starea in care mintea se deschide, invatarea devine placuta si lumea pare plina de posibilitati. Interesul este fundamentul motivatiei intrinsece — faci ceva nu pentru ca trebuie, ci pentru ca te cheama din interior.",
      "en": "Interest is the calm form of anticipation — a warm curiosity that draws you toward something new without urgency. It is the state where the mind opens, learning becomes pleasurable, and the world seems full of possibilities. Interest is the foundation of intrinsic motivation — you do something not because you must, but because it calls you from within."
    },
    "needs": {
      "ro": "explorare si libertate",
      "en": "exploration and freedom"
    },
    "category": "intensity",
    "color": "#FFC8A0",
    "intensity": 0.3,
    "opposite": "distraction",
    "spawns": [
      "anticipation",
      "serenity",
      "optimism"
    ]
  },
  "vigilance": {
    "id": "vigilance",
    "label": {
      "ro": "vigilență",
      "en": "vigilance"
    },
    "description": {
      "ro": "Vigilenta este forma intensa a anticiparii — o stare de alerta maxima in care esti complet concentrat pe ceea ce urmeaza. Toate simturile sunt ascutite si esti gata sa reactionezi instant. Este utila in situatii critice, dar epuizanta daca devine permanenta. Hipervigilenta cronica este adesea un semn al traumei nerezolvate.",
      "en": "Vigilance is the intense form of anticipation — a state of maximum alertness where you are completely focused on what's coming. All senses are sharpened and you are ready to react instantly. It is useful in critical situations, but exhausting if it becomes permanent. Chronic hypervigilance is often a sign of unresolved trauma."
    },
    "needs": {
      "ro": "odihna si reasigurare",
      "en": "rest and reassurance"
    },
    "category": "intensity",
    "color": "#FF8C42",
    "intensity": 0.8,
    "opposite": "amazement",
    "spawns": [
      "anticipation",
      "rage",
      "aggression"
    ]
  }
}
