{
  "guilt": {
    "id": "guilt",
    "label": {
      "ro": "vinovăție",
      "en": "guilt"
    },
    "description": {
      "ro": "Vinovatia este diada secundara a bucuriei si fricii — paradoxul de a te simti bine si a te teme simultan ca nu meriti acea stare. Apare cand fericirea ta intra in conflict cu un simt al obligatiei sau cu suferinta altora. Vinovatia sanatoasa te ghideaza moral; vinovatia disproportionata te saboteaza si te impiedica sa primesti binele din viata ta.",
      "en": "Guilt is the secondary dyad of joy and fear — the paradox of feeling good while simultaneously fearing you don't deserve that state. It arises when your happiness conflicts with a sense of obligation or others' suffering. Healthy guilt guides you morally; disproportionate guilt sabotages you and prevents you from receiving the good in your life."
    },
    "needs": {
      "ro": "auto-permisiune si claritate morala",
      "en": "self-permission and moral clarity"
    },
    "category": "secondary_dyad",
    "color": "#C8D888",
    "intensity": 0.5,
    "components": [
      "joy",
      "fear"
    ],
    "spawns": [
      "joy",
      "fear",
      "serenity",
      "apprehension"
    ]
  },
  "bittersweetness": {
    "id": "bittersweetness",
    "label": {
      "ro": "dulce-amărui",
      "en": "bittersweetness"
    },
    "description": {
      "ro": "Dulce-amaruiul este diada secundara a bucuriei si tristetii — experienta simultana a fericirii si a pierderii. Apare cand un moment frumos poarta in el constiinta tranzitoriei sale. Absolvirile, despartirile afectuoase si amintirile frumoase au toate aceasta calitate. Este una dintre cele mai mature emotii umane, semnul ca poti tine doua adevaruri simultan.",
      "en": "Bittersweetness is the secondary dyad of joy and sadness — the simultaneous experience of happiness and loss. It arises when a beautiful moment carries within it the awareness of its transience. Graduations, affectionate farewells, and beautiful memories all have this quality. It is one of the most mature human emotions, the sign that you can hold two truths simultaneously."
    },
    "needs": {
      "ro": "sustinerea blanda a ambelor adevaruri",
      "en": "holding both truths gently"
    },
    "category": "secondary_dyad",
    "color": "#C8A8D8",
    "intensity": 0.5,
    "components": [
      "joy",
      "sadness"
    ],
    "spawns": [
      "joy",
      "sadness",
      "serenity",
      "pensiveness"
    ]
  },
  "curiosity": {
    "id": "curiosity",
    "label": {
      "ro": "curiozitate",
      "en": "curiosity"
    },
    "description": {
      "ro": "Curiozitatea este diada secundara a increderii si surprinderii — combinatia dintre siguranta de a explora si fascinatia pentru necunoscut. Este motorul invatarii si al descoperirii. Curiozitatea semnaleaza ca te simti suficient de sigur pentru a-ti asuma riscul de a nu sti. In relatii, curiozitatea autentica fata de celalalt este antidotul presupunerilor si al rutinei.",
      "en": "Curiosity is the secondary dyad of trust and surprise — the combination of safety to explore and fascination with the unknown. It is the engine of learning and discovery. Curiosity signals that you feel safe enough to take the risk of not knowing. In relationships, authentic curiosity toward the other is the antidote to assumptions and routine."
    },
    "needs": {
      "ro": "explorare si siguranta",
      "en": "exploration and safety"
    },
    "category": "secondary_dyad",
    "color": "#88D8D8",
    "intensity": 0.5,
    "components": [
      "trust",
      "surprise"
    ],
    "spawns": [
      "trust",
      "surprise",
      "acceptance",
      "amazement"
    ]
  },
  "shame": {
    "id": "shame",
    "label": {
      "ro": "rușine",
      "en": "shame"
    },
    "description": {
      "ro": "Rusinea este diada secundara a fricii si dezgustului — convingerea dureroasa ca nu doar ai facut ceva gresit, ci ca esti ceva gresit. Spre deosebire de vinovatie, care priveste comportamentul, rusinea ataca identitatea. Este una dintre cele mai devastatoare emotii, care te face sa vrei sa dispari. Vindecarea rusinii necesita conexiune umana si vulnerabilitate deliberata.",
      "en": "Shame is the secondary dyad of fear and disgust — the painful conviction that not only did you do something wrong, but that you are something wrong. Unlike guilt, which targets behavior, shame attacks identity. It is one of the most devastating emotions, making you want to disappear. Healing shame requires human connection and deliberate vulnerability."
    },
    "needs": {
      "ro": "conexiune si acceptare neconditionata",
      "en": "connection and unconditional acceptance"
    },
    "category": "secondary_dyad",
    "color": "#90C8A8",
    "intensity": 0.5,
    "components": [
      "fear",
      "disgust"
    ],
    "spawns": [
      "fear",
      "disgust",
      "apprehension",
      "boredom"
    ]
  },
  "outrage": {
    "id": "outrage",
    "label": {
      "ro": "indignare",
      "en": "outrage"
    },
    "description": {
      "ro": "Indignarea este diada secundara a surprinderii si furiei — socul transformat in furie cand descoperi o nedreptate neasteptata. Este emotia care alimenteaza activismul si schimbarea sociala. Indignarea te mobilizeaza sa lupti pentru ceea ce este drept. Devine problematica cand se transforma in indignare cronica — o stare de furie permanenta care te epuizeaza.",
      "en": "Outrage is the secondary dyad of surprise and anger — shock transformed into fury when you discover an unexpected injustice. It is the emotion that fuels activism and social change. Outrage mobilizes you to fight for what is right. It becomes problematic when it turns into chronic outrage — a permanent state of fury that exhausts you."
    },
    "needs": {
      "ro": "dreptate si canalizare constructiva",
      "en": "justice and constructive channeling"
    },
    "category": "secondary_dyad",
    "color": "#E87878",
    "intensity": 0.5,
    "components": [
      "surprise",
      "anger"
    ],
    "spawns": [
      "surprise",
      "anger",
      "amazement",
      "rage"
    ]
  },
  "envy": {
    "id": "envy",
    "label": {
      "ro": "invidie",
      "en": "envy"
    },
    "description": {
      "ro": "Invidia este diada secundara a tristetii si furiei — durerea de a nu avea ceea ce altcineva are, combinata cu resentimentul ca acea persoana are. Invidia iti arata ce iti doresti cu adevarat si unde te simti deficitar. Ascultata cu intelepciune, devine o busola a valorilor tale. Ignorata sau actionata, te consuma si iti otraveste relatiile.",
      "en": "Envy is the secondary dyad of sadness and anger — the pain of not having what someone else has, combined with resentment that they have it. Envy shows you what you truly desire and where you feel deficient. Listened to wisely, it becomes a compass of your values. Ignored or acted upon, it consumes you and poisons your relationships."
    },
    "needs": {
      "ro": "valoare proprie si aspiratie onesta",
      "en": "self-worth and honest aspiration"
    },
    "category": "secondary_dyad",
    "color": "#7898C8",
    "intensity": 0.5,
    "components": [
      "sadness",
      "anger"
    ],
    "spawns": [
      "sadness",
      "anger",
      "grief",
      "annoyance"
    ]
  },
  "cynicism": {
    "id": "cynicism",
    "label": {
      "ro": "cinism",
      "en": "cynicism"
    },
    "description": {
      "ro": "Cinismul este diada secundara a dezgustului si anticiparii — o expectatie negativa cronica bazata pe respingerea valorilor percepute ca false. Cinismul se prezinta ca inteligenta, dar adesea mascheaza dezamagirea si frica de a spera din nou. Este o armura emotionala care te protejeaza de dezamagire, dar te izoleaza si de conexiune autentica.",
      "en": "Cynicism is the secondary dyad of disgust and anticipation — a chronic negative expectation based on the rejection of values perceived as false. Cynicism presents itself as intelligence, but often masks disappointment and the fear of hoping again. It is an emotional armor that protects you from disappointment, but also isolates you from authentic connection."
    },
    "needs": {
      "ro": "incredere reinnoita si speranta blanda",
      "en": "renewed trust and gentle hope"
    },
    "category": "secondary_dyad",
    "color": "#C898A8",
    "intensity": 0.5,
    "components": [
      "disgust",
      "anticipation"
    ],
    "spawns": [
      "disgust",
      "anticipation",
      "boredom",
      "interest"
    ]
  },
  "pride": {
    "id": "pride",
    "label": {
      "ro": "mândrie",
      "en": "pride"
    },
    "description": {
      "ro": "Mandria este diada secundara a furiei si bucuriei — satisfactia fiereasca a realizarii combinata cu energia de a-ti apara meritul. Mandria autentica iti recunoaste valoarea fara a-i diminua pe altii. Mandria exagerata — hybris-ul — ascunde adesea insecuritate. Mandria sanatoasa este ancorata in efort real si te motiveaza sa continui sa cresti.",
      "en": "Pride is the secondary dyad of anger and joy — the fierce satisfaction of achievement combined with the energy to defend your merit. Authentic pride recognizes your value without diminishing others. Exaggerated pride — hubris — often conceals insecurity. Healthy pride is anchored in real effort and motivates you to continue growing."
    },
    "needs": {
      "ro": "recunoastere si incredere ancorata",
      "en": "recognition and grounded confidence"
    },
    "category": "secondary_dyad",
    "color": "#FFB868",
    "intensity": 0.5,
    "components": [
      "anger",
      "joy"
    ],
    "spawns": [
      "anger",
      "joy",
      "ecstasy",
      "annoyance"
    ]
  },
  "sentimentality": {
    "id": "sentimentality",
    "label": {
      "ro": "sentimentalism",
      "en": "sentimentality"
    },
    "description": {
      "ro": "Sentimentalismul este diada secundara a increderii si tristetii — o atasare calda si dureroasa fata de trecut, oameni sau momente care au insemnat ceva. Combina siguranta amintirilor frumoase cu tristetea ca nu mai sunt prezente. Sentimentalismul te conecteaza cu valorile tale profunde, dar poate deveni o refugiere in trecut daca inlocuieste angajamentul cu prezentul.",
      "en": "Sentimentality is the secondary dyad of trust and sadness — a warm and painful attachment to the past, people, or moments that meant something. It combines the safety of beautiful memories with the sadness that they are no longer present. Sentimentality connects you to your deep values, but can become a retreat into the past if it replaces engagement with the present."
    },
    "needs": {
      "ro": "onorarea trecutului si angajare in prezent",
      "en": "honoring the past and engaging the present"
    },
    "category": "secondary_dyad",
    "color": "#A8C8D8",
    "intensity": 0.5,
    "components": [
      "trust",
      "sadness"
    ],
    "spawns": [
      "trust",
      "sadness",
      "acceptance",
      "pensiveness"
    ]
  },
  "despair": {
    "id": "despair",
    "label": {
      "ro": "disperare",
      "en": "despair"
    },
    "description": {
      "ro": "Disperarea este diada secundara a fricii si tristetii — o stare in care pierderea se combina cu teroarea ca nimic nu se va mai imbunatati. Este punctul in care speranta pare sa dispara complet. Disperarea este un semnal de alarma ca ai nevoie de sprijin — nu trebuie traversata singur. Chiar si in cele mai intunecate momente, conexiunea umana poate reaprinde speranta.",
      "en": "Despair is the secondary dyad of fear and sadness — a state where loss combines with the terror that nothing will ever improve. It is the point where hope seems to disappear completely. Despair is an alarm signal that you need support — it should not be traversed alone. Even in the darkest moments, human connection can reignite hope."
    },
    "needs": {
      "ro": "sprijin uman si ajutor profesional",
      "en": "human support and professional help"
    },
    "category": "secondary_dyad",
    "color": "#68A8B8",
    "intensity": 0.5,
    "components": [
      "fear",
      "sadness"
    ],
    "spawns": [
      "fear",
      "sadness",
      "apprehension",
      "grief"
    ]
  },
  "dominance": {
    "id": "dominance",
    "label": {
      "ro": "dominanță",
      "en": "dominance"
    },
    "description": {
      "ro": "Dominanta este diada secundara a furiei si increderii — combinatia dintre forta de a impune si siguranta ca ai dreptul sa o faci. Este emotia liderului care isi asuma responsabilitatea. Dominanta sanatoasa protejeaza si ghideaza; dominanta toxica controleaza si submineaza. Diferenta sta in prezenta sau absenta empatiei si respectului pentru autonomia celuilalt.",
      "en": "Dominance is the secondary dyad of anger and trust — the combination of the force to impose and the confidence that you have the right to do so. It is the emotion of a leader taking responsibility. Healthy dominance protects and guides; toxic dominance controls and undermines. The difference lies in the presence or absence of empathy and respect for the other's autonomy."
    },
    "needs": {
      "ro": "empatie si impartirea puterii",
      "en": "empathy and shared power"
    },
    "category": "secondary_dyad",
    "color": "#D89888",
    "intensity": 0.5,
    "components": [
      "anger",
      "trust"
    ],
    "spawns": [
      "anger",
      "trust",
      "annoyance",
      "admiration"
    ]
  },
  "delight": {
    "id": "delight",
    "label": {
      "ro": "încântare",
      "en": "delight"
    },
    "description": {
      "ro": "Incantarea este diada secundara a bucuriei si surprinderii — explozia de fericire care apare cand ceva neasteptat de frumos se intampla. Este bucuria amplificata de noutate. Incantarea este una dintre cele mai energizante emotii — te face sa zambesti involuntar si sa vrei sa impartasesti momentul cu altii. Este ingredientul secret al relatiilor vii.",
      "en": "Delight is the secondary dyad of joy and surprise — the burst of happiness that arises when something unexpectedly beautiful happens. It is joy amplified by novelty. Delight is one of the most energizing emotions — it makes you smile involuntarily and want to share the moment with others. It is the secret ingredient of vibrant relationships."
    },
    "needs": {
      "ro": "savurare si partajare",
      "en": "savoring and sharing"
    },
    "category": "secondary_dyad",
    "color": "#FFE898",
    "intensity": 0.5,
    "components": [
      "joy",
      "surprise"
    ],
    "spawns": [
      "joy",
      "surprise",
      "serenity",
      "amazement"
    ]
  },
  "pessimism": {
    "id": "pessimism",
    "label": {
      "ro": "pesimism",
      "en": "pessimism"
    },
    "description": {
      "ro": "Pesimismul este diada secundara a tristetii si anticiparii — o expectatie negativa a viitorului colorata de experienta pierderii. Mintea ta extrapoleaza suferinta trecuta in scenarii viitoare. Pesimismul defensiv poate fi o strategie de protectie — daca te astepti la ce e mai rau, dezamagirea doare mai putin. Dar devine costisitor cand te impiedica sa actionezi si sa speri.",
      "en": "Pessimism is the secondary dyad of sadness and anticipation — a negative expectation of the future colored by the experience of loss. Your mind extrapolates past suffering into future scenarios. Defensive pessimism can be a protective strategy — if you expect the worst, disappointment hurts less. But it becomes costly when it prevents you from acting and hoping."
    },
    "needs": {
      "ro": "provocare blanda si mici victorii",
      "en": "gentle challenge and small wins"
    },
    "category": "secondary_dyad",
    "color": "#8898C8",
    "intensity": 0.5,
    "components": [
      "sadness",
      "anticipation"
    ],
    "spawns": [
      "sadness",
      "anticipation",
      "pensiveness",
      "interest"
    ]
  }
}
