{
  "morbidness": {
    "id": "morbidness",
    "label": {
      "ro": "morbiditate",
      "en": "morbidness"
    },
    "description": {
      "ro": "Morbiditatea este diada tertiara a dezgustului si bucuriei — atractia paradoxala catre ceea ce este intuneric, grotesc sau taboo, combinata cu o placere secreta in explorarea lui. Este fascinatia pentru moarte, descompunere sau suferinta care coexista cu o satisfactie perversa. Poate reflecta o incercare a psihicului de a integra aspectele umbre ale existentei.",
      "en": "Morbidness is the tertiary dyad of disgust and joy — the paradoxical attraction to what is dark, grotesque, or taboo, combined with a secret pleasure in exploring it. It is the fascination with death, decay, or suffering that coexists with a perverse satisfaction. It may reflect the psyche's attempt to integrate the shadow aspects of existence."
    },
    "needs": {
      "ro": "integrare si exprimare creativa",
      "en": "integration and creative expression"
    },
    "category": "tertiary_dyad",
    "color": "#C8A0C8",
    "intensity": 0.4,
    "components": [
      "disgust",
      "joy"
    ],
    "spawns": [
      "disgust",
      "joy",
      "boredom",
      "serenity"
    ]
  },
  "unbelief": {
    "id": "unbelief",
    "label": {
      "ro": "neîncredere",
      "en": "unbelief"
    },
    "description": {
      "ro": "Neincrederea este diada tertiara a surprinderii si dezgustului — refuzul de a accepta ceva neasteptat combinat cu o reactie de respingere. Este starea de 'nu se poate' cand realitatea contrazice convingerile tale fundamentale. Neincrederea te protejeaza temporar de socul schimbarii, dar daca persista, te impiedica sa integrezi informatii noi si sa te adaptezi.",
      "en": "Unbelief is the tertiary dyad of surprise and disgust — the refusal to accept something unexpected combined with a rejection response. It is the state of 'this can't be' when reality contradicts your fundamental beliefs. Unbelief temporarily protects you from the shock of change, but if it persists, it prevents you from integrating new information and adapting."
    },
    "needs": {
      "ro": "timp si acceptare treptata",
      "en": "time and gradual acceptance"
    },
    "category": "tertiary_dyad",
    "color": "#A898C8",
    "intensity": 0.4,
    "components": [
      "surprise",
      "disgust"
    ],
    "spawns": [
      "surprise",
      "disgust",
      "distraction",
      "boredom"
    ]
  },
  "ruthlessness": {
    "id": "ruthlessness",
    "label": {
      "ro": "neîndurare",
      "en": "ruthlessness"
    },
    "description": {
      "ro": "Neindurarea este diada tertiara a furiei si anticiparii la nivel maxim — o determinare rece si calculata de a-ti atinge scopul indiferent de costul uman. Spre deosebire de agresivitate, care pastreaza o componenta emotionala activa, neindurarea este lipsita de empatie temporar. Poate fi utila in situatii de criza care cer decizii rapide, dar devine distructiva cand devine un mod de viata.",
      "en": "Ruthlessness is the tertiary dyad of anger and anticipation at maximum level — a cold, calculated determination to achieve your goal regardless of human cost. Unlike aggression, which retains an active emotional component, ruthlessness is temporarily devoid of empathy. It can be useful in crisis situations requiring rapid decisions, but becomes destructive when it becomes a way of life."
    },
    "needs": {
      "ro": "empatie si reancorare relationala",
      "en": "empathy and relational re-anchoring"
    },
    "category": "tertiary_dyad",
    "color": "#FF7850",
    "intensity": 0.7,
    "components": [
      "rage",
      "vigilance"
    ],
    "spawns": [
      "anger",
      "anticipation",
      "rage",
      "vigilance"
    ]
  }
}
