{
  "aggressive": {
    "id": "aggressive",
    "label": {
      "ro": "Agresiv",
      "en": "Aggressive"
    },
    "color": "#EE9E9E",
    "level": 1,
    "parent": "angry",
    "children": [
      "provoked",
      "hostile"
    ],
    "description": {
      "ro": "Agresivitatea este energia furiei orientata catre actiune — un impuls de a ataca, domina sau distruge obstacolul. Poate fi fizica, verbala sau pasiva. Agresivitatea nu este intotdeauna disfunctionala — in forme asertive, te ajuta sa iti aperi granitele. Devine problematica cand este disproportionata, indreptata gresit sau cronica.",
      "en": "Aggressiveness is the energy of anger oriented toward action — an impulse to attack, dominate, or destroy the obstacle. It can be physical, verbal, or passive. Aggression is not always dysfunctional — in assertive forms, it helps you defend your boundaries. It becomes problematic when it is disproportionate, misdirected, or chronic."
    },
    "needs": {
      "ro": "exprimare canalizata si continere",
      "en": "channeled expression and containment"
    }
  },
  "provoked": {
    "id": "provoked",
    "label": {
      "ro": "Provocat",
      "en": "Provoked"
    },
    "color": "#F4B4B4",
    "level": 2,
    "parent": "aggressive",
    "description": {
      "ro": "A fi provocat inseamna ca cineva ti-a activat intentionat furia sau frustrarea. Te simti manipulat si reactionezi defensiv. Provocarea functioneaza prin exploatarea punctelor tale sensibile. Capacitatea de a nu reactiona automat la provocare este un semn de maturitate emotionala — inseamna ca tu alegi raspunsul, nu provocatorul.",
      "en": "Being provoked means someone intentionally activated your anger or frustration. You feel manipulated and react defensively. Provocation works by exploiting your sensitive points. The capacity not to react automatically to provocation is a sign of emotional maturity — it means you choose the response, not the provocateur."
    },
    "needs": {
      "ro": "autoreglare si alegere constienta",
      "en": "self-regulation and conscious choice"
    }
  },
  "hostile": {
    "id": "hostile",
    "label": {
      "ro": "Ostil",
      "en": "Hostile"
    },
    "color": "#F4B4B4",
    "level": 2,
    "parent": "aggressive",
    "description": {
      "ro": "Ostilitatea este o predispozitie generalizata de agresiune — o stare in care percepi lumea ca ostila si reactionezi cu atac preventiv. Este furia cronicizata care a devenit un mod de a fi. Ostilitatea este un factor de risc major pentru sanatatea cardiovasculara si pentru izolarea sociala. Lucrul terapeutic vizeaza randurile profunde sub armura agresiva.",
      "en": "Hostility is a generalized predisposition to aggression — a state where you perceive the world as hostile and react with preemptive attack. It is chronified anger that has become a way of being. Hostility is a major risk factor for cardiovascular health and social isolation. Therapeutic work targets the deep wounds beneath the aggressive armor."
    },
    "needs": {
      "ro": "sustinere terapeutica si vulnerabilitate",
      "en": "therapeutic support and vulnerability"
    }
  },
  "frustrated": {
    "id": "frustrated",
    "label": {
      "ro": "Frustrat",
      "en": "Frustrated"
    },
    "color": "#EE9E9E",
    "level": 1,
    "parent": "angry",
    "children": [
      "infuriated",
      "annoyed",
      "exasperated"
    ],
    "description": {
      "ro": "Frustrarea apare cand un obstacol sta intre tine si obiectivul tau — vrei sa avansezi dar nu poti. Este furia blocata de neputinta. Frustrarea tolerate te invata rabdare si creativitate in gasirea solutiilor alternative. Frustrarea netolerata poate escalada in furie sau poate duce la renuntare prematura.",
      "en": "Frustration arises when an obstacle stands between you and your goal — you want to advance but cannot. It is anger blocked by helplessness. Tolerated frustration teaches you patience and creativity in finding alternative solutions. Untolerated frustration can escalate into rage or lead to premature giving up."
    },
    "needs": {
      "ro": "o abordare noua si rabdare",
      "en": "a new approach and patience"
    }
  },
  "infuriated": {
    "id": "infuriated",
    "label": {
      "ro": "Infuriat",
      "en": "Infuriated"
    },
    "color": "#F4B4B4",
    "level": 2,
    "parent": "frustrated",
    "description": {
      "ro": "A fi infuriat este o furia intensa provocata de o frustrare care se acumuleaza dincolo de limita suportabilului. Este punctul de fierbere la care rabdarea se epuizeaza complet. Infurierea este adesea disproportionata fata de evenimentul declansator, deoarece include furia neexprimata din situatii anterioare.",
      "en": "Being infuriated is intense anger provoked by frustration accumulating beyond the limit of tolerance. It is the boiling point at which patience is completely exhausted. Infuriation is often disproportionate to the triggering event, because it includes unexpressed anger from previous situations."
    },
    "needs": {
      "ro": "descarcare si exprimarea nevoilor neindeplinite",
      "en": "discharge and expressing unmet needs"
    }
  },
  "annoyed": {
    "id": "annoyed",
    "label": {
      "ro": "Enervat",
      "en": "Annoyed"
    },
    "color": "#F4B4B4",
    "level": 2,
    "parent": "frustrated",
    "description": {
      "ro": "Enervarea este o iritare de suprafata care semnaleaza ca ceva mic dar persistent te deranjeaza. Este furia in forma ei cea mai cotidiana. Enervarea repetata merita atentie — poate indica limite neclare, nevoi nesatisfacute sau o toleranta redusa din cauza stresului acumulat. Adesea, ceea ce te enerveaza la altii te deranjeaza si la tine.",
      "en": "Annoyance is a surface irritation signaling that something small but persistent bothers you. It is anger in its most everyday form. Repeated annoyance deserves attention — it may indicate unclear boundaries, unmet needs, or reduced tolerance from accumulated stress. Often, what annoys you in others also bothers you in yourself."
    },
    "needs": {
      "ro": "limite clare si verificare interioara",
      "en": "clear boundaries and self-check"
    }
  },
  "exasperated": {
    "id": "exasperated",
    "label": {
      "ro": "Exasperat",
      "en": "Exasperated"
    },
    "color": "#F4B4B4",
    "level": 2,
    "parent": "frustrated",
    "description": {
      "ro": "Exasperarea este frustrarea care s-a acumulat prin repetitie — acelasi obstacol, aceeasi problema, aceeasi situatie care se repeta pana cand rabdarea ta se epuizeaza complet. Nu este furia brusca, ci uzura lenta a tolerantei. Exasperarea este un semnal ca o abordare fundamental diferita este necesara — nu mai mult efort pe acelasi drum, ci un drum nou. Recunoaste-o ca pe o invitatie la schimbare, nu ca pe un esec al rabdarii tale.",
      "en": "Exasperation is frustration that has accumulated through repetition — the same obstacle, the same problem, the same situation repeating until your patience is completely depleted. It is not sudden anger, but the slow wearing down of tolerance. Exasperation is a signal that a fundamentally different approach is needed — not more effort on the same path, but a new path. Recognize it as an invitation to change, not as a failure of your patience."
    },
    "needs": {
      "ro": "o abordare noua si sustinere",
      "en": "a new approach and support"
    }
  },
  "distant": {
    "id": "distant",
    "label": {
      "ro": "Distant",
      "en": "Distant"
    },
    "color": "#EE9E9E",
    "level": 1,
    "parent": "angry",
    "children": [
      "withdrawn",
      "numb",
      "detached"
    ],
    "description": {
      "ro": "Distanta emotionala este retragerea constienta sau inconstienta din conectare — te inchizi in tine, ridici ziduri si nu mai lasi pe nimeni sa se apropie. Poate fi o strategie de protectie dupa rani repetate sau un semn de epuizare emotionala. Distanta cronica iti protejeaza vulnerabilitatea, dar te izoleaza de intimitate si apartinere.",
      "en": "Emotional distance is the conscious or unconscious withdrawal from connection — you close yourself off, raise walls, and don't let anyone get close. It can be a protective strategy after repeated wounds or a sign of emotional exhaustion. Chronic distance protects your vulnerability, but isolates you from intimacy and belonging."
    },
    "needs": {
      "ro": "reconectare treptata si siguranta",
      "en": "gradual reconnection and safety"
    }
  },
  "withdrawn": {
    "id": "withdrawn",
    "label": {
      "ro": "Retras",
      "en": "Withdrawn"
    },
    "color": "#F4B4B4",
    "level": 2,
    "parent": "distant",
    "description": {
      "ro": "Retragerea este miscarea de a te indeparta emotional sau fizic de situatii si de oameni. Poate fi o strategie sanatoasa de autoprotectie sau un semn de depresie si izolare. Retragerea devine problematica cand este cronica si inlocuieste comunicarea directa. In spatele retragerii se ascund adesea rani nevindecate si frica de a fi ranit din nou.",
      "en": "Withdrawal is the movement of distancing yourself emotionally or physically from situations and people. It can be a healthy self-protective strategy or a sign of depression and isolation. Withdrawal becomes problematic when it's chronic and replaces direct communication. Behind withdrawal often hide unhealed wounds and fear of being hurt again."
    },
    "needs": {
      "ro": "reconectare sigura in ritmul propriu",
      "en": "safe reconnection at own pace"
    }
  },
  "numb": {
    "id": "numb",
    "label": {
      "ro": "Amorțit",
      "en": "Numb"
    },
    "color": "#F4B4B4",
    "level": 2,
    "parent": "distant",
    "description": {
      "ro": "Amortirea emotionala este starea in care nu mai simti nimic — nici durere, nici bucurie. Este un mecanism de protectie al psihicului impotriva suferintei coplesitoare. Amortirea poate aparea dupa traume, pierderi majore sau stres cronic prelungit. Desi te protejeaza pe termen scurt, pe termen lung te deconecteaza de la viata si relatii. Revenirea la simtire necesita siguranta si rabdare.",
      "en": "Emotional numbness is the state where you no longer feel anything — neither pain nor joy. It is a protective mechanism of the psyche against overwhelming suffering. Numbness can arise after traumas, major losses, or prolonged chronic stress. Though it protects you short-term, long-term it disconnects you from life and relationships. Returning to feeling requires safety and patience."
    },
    "needs": {
      "ro": "rabdare, siguranta si simtire blanda",
      "en": "patience, safety, and gentle feeling"
    }
  },
  "detached": {
    "id": "detached",
    "label": {
      "ro": "Detasat",
      "en": "Detached"
    },
    "color": "#F4B4B4",
    "level": 2,
    "parent": "distant",
    "description": {
      "ro": "Detasarea este deconectarea emotionala constienta sau semiconstienta de la ceea ce se intampla in jurul tau — esti prezent fizic dar absent emotional, observi fara sa participi cu adevarat. Spre deosebire de amorteala, care este involuntara, detasarea poate fi o strategie deliberata de protectie dupa rani repetate. Insa cand devine cronica, te izoleaza de intimitate, de bucurie si de capacitatea de a fi cu adevarat prezent in relatii.",
      "en": "Detachment is the conscious or semi-conscious emotional disconnection from what is happening around you — you are physically present but emotionally absent, observing without truly participating. Unlike numbness, which is involuntary, detachment can be a deliberate protective strategy after repeated wounds. However, when it becomes chronic, it isolates you from intimacy, joy, and the ability to be truly present in relationships."
    },
    "needs": {
      "ro": "reconectare treptata si siguranta",
      "en": "gradual reconnection and safety"
    }
  },
  "critical": {
    "id": "critical",
    "label": {
      "ro": "Critic",
      "en": "Critical"
    },
    "color": "#EE9E9E",
    "level": 1,
    "parent": "angry",
    "children": [
      "skeptical",
      "dismissive"
    ],
    "description": {
      "ro": "A fi critic este tendinta de a evalua si judeca constant — pe tine, pe altii si situatiile din jur. Poate reflecta standarde inalte si discernamant, dar si o furie mascata sau o nesiguranta proiectata. Critica cronica erodeaza relatiile si stima de sine. Alternativa sanatoasa este feedbackul constructiv, oferit cu empatie si respect.",
      "en": "Being critical is the tendency to constantly evaluate and judge — yourself, others, and surrounding situations. It can reflect high standards and discernment, but also masked anger or projected insecurity. Chronic criticism erodes relationships and self-esteem. The healthy alternative is constructive feedback, offered with empathy and respect."
    },
    "needs": {
      "ro": "constientizare de sine si empatie",
      "en": "self-awareness and empathy"
    }
  },
  "skeptical": {
    "id": "skeptical",
    "label": {
      "ro": "Sceptic",
      "en": "Skeptical"
    },
    "color": "#F4B4B4",
    "level": 2,
    "parent": "critical",
    "description": {
      "ro": "Scepticismul este tendinta de a pune la indoiala si de a nu accepta lucrurile la valoarea lor de suprafata. Poate reflecta gandire critica sanatoasa sau poate masca frica de a fi pacalit sau dezamagit din nou. Scepticismul constructiv te protejeaza de manipulare; scepticismul toxic te impiedica sa te conectezi si sa ai incredere.",
      "en": "Skepticism is the tendency to question and not accept things at face value. It can reflect healthy critical thinking or can mask the fear of being fooled or disappointed again. Constructive skepticism protects you from manipulation; toxic skepticism prevents you from connecting and trusting."
    },
    "needs": {
      "ro": "discernamant si deschidere catre incredere",
      "en": "discernment and openness to trust"
    }
  },
  "dismissive": {
    "id": "dismissive",
    "label": {
      "ro": "Disprețuitor",
      "en": "Dismissive"
    },
    "color": "#F4B4B4",
    "level": 2,
    "parent": "critical",
    "description": {
      "ro": "A fi dipretuitor inseamna a invalida sau minimiza experienta, opiniile sau sentimentele celorlalti. Este o forma de distantare care iti permite sa eviti angajamentul emotional. Dispretul poate masca insecuritate sau superioritate compensatorie. In relatii, comportamentul dipretuitor este profund ranitor si erodeaza conexiunea.",
      "en": "Being dismissive means invalidating or minimizing the experience, opinions, or feelings of others. It is a form of distancing that allows you to avoid emotional engagement. Dismissiveness can mask insecurity or compensatory superiority. In relationships, dismissive behavior is deeply hurtful and erodes connection."
    },
    "needs": {
      "ro": "constientizare de sine si implicare autentica",
      "en": "self-awareness and genuine engagement"
    }
  }
}
