{
  "fearful": {
    "id": "fearful",
    "label": {
      "ro": "Temator",
      "en": "Fearful"
    },
    "color": "#88C8A0",
    "level": 0,
    "children": [
      "scared",
      "anxious",
      "insecure",
      "weak",
      "rejected",
      "threatened"
    ],
    "description": {
      "ro": "Teama este o stare generala de nesiguranta si anticipare a pericolului. Corpul este in alerta, mintea scaneaza amenintari si comportamentul devine precaut. Teama te protejeaza, dar cand devine disproportionata sau cronica, iti restrange viata si te impiedica sa cresti. Lucrul cu teama inseamna sa o asculti fara a-i preda controlul.",
      "en": "Fearfulness is a general state of insecurity and danger anticipation. The body is alert, the mind scans for threats, and behavior becomes cautious. Fear protects you, but when it becomes disproportionate or chronic, it narrows your life and prevents growth. Working with fear means listening to it without surrendering control."
    },
    "needs": {
      "ro": "siguranta si reasigurare",
      "en": "safety and reassurance"
    }
  },
  "scared": {
    "id": "scared",
    "label": {
      "ro": "Speriat",
      "en": "Scared"
    },
    "color": "#9CD4B0",
    "level": 1,
    "parent": "fearful",
    "children": [
      "helpless",
      "frightened",
      "panicked"
    ],
    "description": {
      "ro": "A fi speriat este raspunsul emotional la un pericol perceput ca imediat si concret. Corpul se pregateste de fuga sau lupta, inima bate rapid si atentia se concentreaza exclusiv pe amenintare. Spaima este un raspuns adaptativ esential, dar poate deveni debilitanta cand este declansata de situatii care nu sunt realmente periculoase.",
      "en": "Being scared is the emotional response to a danger perceived as immediate and concrete. The body prepares for flight or fight, the heart beats rapidly, and attention focuses exclusively on the threat. Being scared is an essential adaptive response, but can become debilitating when triggered by situations that are not actually dangerous."
    },
    "needs": {
      "ro": "protectie si o prezenta sigura",
      "en": "protection and a safe presence"
    }
  },
  "helpless": {
    "id": "helpless",
    "label": {
      "ro": "Neajutorat",
      "en": "Helpless"
    },
    "color": "#B0E0C0",
    "level": 2,
    "parent": "scared",
    "description": {
      "ro": "Neputinta este starea in care simti ca nu poti face nimic pentru a schimba o situatie dureroasa. Este una dintre cele mai debilitante experiente emotionale, pentru ca ataca insusi sentimentul de agentivitate. Neputinta invatata — convingerea ca efortul tau nu conteaza — este un factor central in depresie. Recuperarea incepe cu pasi mici si controlabili.",
      "en": "Helplessness is the state where you feel you can do nothing to change a painful situation. It is one of the most debilitating emotional experiences, because it attacks the very sense of agency. Learned helplessness — the conviction that your effort doesn't matter — is a central factor in depression. Recovery begins with small, controllable steps."
    },
    "needs": {
      "ro": "un pas mic si sustinere",
      "en": "one small step and support"
    }
  },
  "frightened": {
    "id": "frightened",
    "label": {
      "ro": "Infricosat",
      "en": "Frightened"
    },
    "color": "#B0E0C0",
    "level": 2,
    "parent": "scared",
    "description": {
      "ro": "A fi infricosat este o stare de frica intensa si sustinuta in care pericolul pare coplesitor si resursele tale insuficiente. Corpul este in alerta maxima, dar te simti paralizat de magnitudinea amenintarii. Infricosarea necesita un spatiu de siguranta si prezenta unui aliat care te poate ajuta sa iti reglezi sistemul nervos.",
      "en": "Being frightened is a state of intense and sustained fear where danger seems overwhelming and your resources insufficient. The body is on maximum alert, but you feel paralyzed by the magnitude of the threat. Fright requires a safe space and the presence of an ally who can help you regulate your nervous system."
    },
    "needs": {
      "ro": "un spatiu sigur si un aliat calm",
      "en": "a safe space and a calming ally"
    }
  },
  "panicked": {
    "id": "panicked",
    "label": {
      "ro": "Panicat",
      "en": "Panicked"
    },
    "color": "#B0E0C0",
    "level": 2,
    "parent": "scared",
    "description": {
      "ro": "Panica este momentul in care frica devine atat de intensa incat gandirea rationala se prabuseste — sistemul de lupta-sau-fugi preia controlul complet. Corpul se inunda cu adrenalina, respiratia devine rapida si superficiala, iar capacitatea de a lua decizii clare dispare temporar. Panica este un raspuns normal la amenintari percepute ca extreme, nu un semn de slabiciune. Primul pas in gestionarea panicii este sa iti amintesti ca este o stare temporara care va trece.",
      "en": "Panic is the moment when fear becomes so intense that rational thinking collapses — the fight-or-flight system takes complete control. The body floods with adrenaline, breathing becomes rapid and shallow, and the ability to make clear decisions temporarily vanishes. Panic is a normal response to threats perceived as extreme, not a sign of weakness. The first step in managing panic is to remember that it is a temporary state that will pass."
    },
    "needs": {
      "ro": "ancorare si calmare imediata",
      "en": "grounding and immediate calming"
    }
  },
  "anxious": {
    "id": "anxious",
    "label": {
      "ro": "Anxios",
      "en": "Anxious"
    },
    "color": "#9CD4B0",
    "level": 1,
    "parent": "fearful",
    "children": [
      "overwhelmed_fear",
      "worried",
      "apprehensive"
    ],
    "description": {
      "ro": "Anxietatea este o stare de neliniste persistenta orientata catre viitor — o anticipare cronica a pericolelor care nu s-au materializat inca. Spre deosebire de frica, care are un obiect clar, anxietatea este adesea difuza si greu de localizat. Corpul ramane in alerta permanenta, consumand resurse pretioase. Anxietatea se trateaza prin constientizare, reglare somatica si expunere treptata.",
      "en": "Anxiety is a persistent restlessness oriented toward the future — a chronic anticipation of dangers that haven't materialized yet. Unlike fear, which has a clear object, anxiety is often diffuse and hard to locate. The body remains on permanent alert, consuming precious resources. Anxiety is treated through awareness, somatic regulation, and gradual exposure."
    },
    "needs": {
      "ro": "ancorare si calmare",
      "en": "grounding and soothing"
    }
  },
  "overwhelmed_fear": {
    "id": "overwhelmed_fear",
    "label": {
      "ro": "Coplesit",
      "en": "Overwhelmed"
    },
    "color": "#B0E0C0",
    "level": 2,
    "parent": "anxious",
    "description": {
      "ro": "A fi coplesit de frica inseamna ca intensitatea anxietatii a depasit capacitatea ta de a o gestiona. Totul pare amenintator, nu mai poti gandi clar si simti ca te ineci emotional. Aceasta stare necesita interventie imediata de calmare — respiratie lenta, grounding fizic si prezenta unei persoane de incredere care te ancoreaza.",
      "en": "Being overwhelmed by fear means the intensity of anxiety has exceeded your capacity to manage it. Everything seems threatening, you can no longer think clearly, and you feel emotionally drowning. This state requires immediate calming intervention — slow breathing, physical grounding, and the presence of a trusted person who anchors you."
    },
    "needs": {
      "ro": "ancorare, respiratie si prezenta",
      "en": "grounding, breathing, and presence"
    }
  },
  "worried": {
    "id": "worried",
    "label": {
      "ro": "Ingrijorat",
      "en": "Worried"
    },
    "color": "#B0E0C0",
    "level": 2,
    "parent": "anxious",
    "description": {
      "ro": "Ingrijorarea este gandirea repetitiva despre potentiale probleme viitoare — un dialog intern in care mintea construieste scenarii negative si incearca sa le rezolve preventiv. Ingrijorarea moderata este adaptativa si te ajuta sa planifici. Ingrijorarea cronica este o forma de anxietate care te epuizeaza fara a produce solutii reale.",
      "en": "Worry is repetitive thinking about potential future problems — an internal dialogue where the mind constructs negative scenarios and tries to solve them preventively. Moderate worry is adaptive and helps you plan. Chronic worry is a form of anxiety that exhausts you without producing real solutions."
    },
    "needs": {
      "ro": "reasigurare si un plan concret",
      "en": "reassurance and a concrete plan"
    }
  },
  "apprehensive": {
    "id": "apprehensive",
    "label": {
      "ro": "Cu presimtiri",
      "en": "Apprehensive"
    },
    "color": "#B0E0C0",
    "level": 2,
    "parent": "anxious",
    "description": {
      "ro": "Temerea este nelinistitea vaga, anticipativa, care apare cand simti ca ceva ar putea merge prost, fara sa poti numi exact ce. Este anxietatea in forma ei cea mai difuza — o senzatie de fond ca ceva nu este in regula, care coloreaza tot ce faci fara sa aiba un obiect clar. Temerea este de fapt sistemul tau de alerta care functioneaza la intensitate scazuta, scanand orizontul pentru potentiale probleme.",
      "en": "Apprehension is the vague, anticipatory unease that arises when you sense something might go wrong, without being able to name exactly what. It is anxiety in its most diffuse form — a background sensation that something is not right, coloring everything you do without having a clear object. Apprehension is actually your alert system functioning at low intensity, scanning the horizon for potential problems."
    },
    "needs": {
      "ro": "reasigurare si ancorare in prezent",
      "en": "reassurance and grounding in the present"
    }
  },
  "insecure": {
    "id": "insecure",
    "label": {
      "ro": "Nesigur",
      "en": "Insecure"
    },
    "color": "#9CD4B0",
    "level": 1,
    "parent": "fearful",
    "children": [
      "inadequate",
      "inferior_fear",
      "self_doubting"
    ],
    "description": {
      "ro": "Nesiguranta este indoiala persistenta cu privire la propria valoare, competenta sau pozitie sociala. Te simti instabil, vulnerabil la critica si dependent de validarea externa. Nesiguranta isi are adesea originile in experienta timpurie de atasament. Vindecarea vine din construirea treptata a unei baze interne de siguranta prin experienta constienta.",
      "en": "Insecurity is the persistent doubt about your own worth, competence, or social position. You feel unstable, vulnerable to criticism, and dependent on external validation. Insecurity often has its origins in early attachment experience. Healing comes from gradually building an internal base of security through conscious experience."
    },
    "needs": {
      "ro": "validare si sustinere constanta",
      "en": "validation and steady support"
    }
  },
  "inadequate": {
    "id": "inadequate",
    "label": {
      "ro": "Inadecvat",
      "en": "Inadequate"
    },
    "color": "#B0E0C0",
    "level": 2,
    "parent": "insecure",
    "description": {
      "ro": "Sentimentul de inadecvare este convingerea dureroasa ca nu esti suficient — nu destul de bun, de destept, de frumos sau de capabil. Este o evaluare interna severa care te compara constant cu un standard imposibil. Inadecvarea este adesea ecoul unor voci critice internalizate din copilarie. Vindecarea vine prin compasiune fata de sine si revizuirea standardelor.",
      "en": "The feeling of inadequacy is the painful conviction that you are not enough — not good enough, smart enough, beautiful enough, or capable enough. It is a harsh internal evaluation constantly comparing you to an impossible standard. Inadequacy is often the echo of critical voices internalized from childhood. Healing comes through self-compassion and revising standards."
    },
    "needs": {
      "ro": "auto-compasiune si standarde realiste",
      "en": "self-compassion and realistic standards"
    }
  },
  "inferior_fear": {
    "id": "inferior_fear",
    "label": {
      "ro": "Inferior",
      "en": "Inferior"
    },
    "color": "#B0E0C0",
    "level": 2,
    "parent": "insecure",
    "description": {
      "ro": "Sentimentul de inferioritate este convingerea profunda ca esti fundamental mai putin valoros decat ceilalti. Este o rana a stimei de sine care coloreaza toate interactiunile sociale cu comparatie si autodevalorizare. Complexul de inferioritate, cum l-a descris Adler, poate motiva fie compensare excesiva, fie retragere sociala.",
      "en": "The feeling of inferiority is the deep conviction that you are fundamentally less valuable than others. It is a wound of self-esteem that colors all social interactions with comparison and self-devaluation. The inferiority complex, as Adler described it, can motivate either excessive compensation or social withdrawal."
    },
    "needs": {
      "ro": "afirmarea valorii inerente",
      "en": "affirmation of inherent worth"
    }
  },
  "self_doubting": {
    "id": "self_doubting",
    "label": {
      "ro": "Plin de indoieli",
      "en": "Self-Doubting"
    },
    "color": "#B0E0C0",
    "level": 2,
    "parent": "insecure",
    "description": {
      "ro": "Indoiala de sine este punerea sub semnul intrebarii a propriei judecati, perceptii si decizii — nu te simti inadecvat sau inferior, ci nesigur daca poti avea incredere in propria ta evaluare a lucrurilor. Este vocea interioara care intreaba mereu \"dar daca gresesc?\" chiar si atunci cand ai motive sa ai incredere in tine. Indoiala de sine devine problematica cand te blocheaza in inactiune, dar in doze mici este un semn de umilitate si deschidere catre invatare.",
      "en": "Self-doubt is the questioning of your own judgment, perceptions, and decisions — you do not feel inadequate or inferior, but uncertain whether you can trust your own evaluation of things. It is the inner voice that constantly asks 'what if I am wrong?' even when you have reason to trust yourself. Self-doubt becomes problematic when it blocks you into inaction, but in small doses it is a sign of humility and openness to learning."
    },
    "needs": {
      "ro": "validare si incredere treptata",
      "en": "validation and gradual confidence"
    }
  }
}
