{
  "powerful": {
    "id": "powerful",
    "label": {
      "ro": "Puternic",
      "en": "Powerful"
    },
    "color": "#FFE57F",
    "level": 1,
    "parent": "happy",
    "children": [
      "courageous",
      "creative",
      "determined"
    ],
    "description": {
      "ro": "Sentimentul de putere este experienta de a avea capacitate, influenta si control asupra directiei vietii tale. Nu inseamna dominatie, ci agentivitate — convingerea ca poti face o diferenta. Puterea interioara sanatoasa vine din competenta, curaj si aliniere cu valorile tale, nu din controlul celorlalti.",
      "en": "The feeling of power is the experience of having capacity, influence, and control over the direction of your life. It doesn't mean domination, but agency — the conviction that you can make a difference. Healthy inner power comes from competence, courage, and alignment with your values, not from controlling others."
    },
    "needs": {
      "ro": "agentivitate si provocare",
      "en": "agency and challenge"
    }
  },
  "courageous": {
    "id": "courageous",
    "label": {
      "ro": "Curajos",
      "en": "Courageous"
    },
    "color": "#FFF0A0",
    "level": 2,
    "parent": "powerful",
    "description": {
      "ro": "Curajul nu este absenta fricii, ci alegerea constienta de a actiona in ciuda ei. Este capacitatea de a merge inainte cand totul in tine vrea sa se retraga. Curajul emotional — sa fii vulnerabil, sa spui adevarul, sa ceri ajutor — este adesea mai dificil decat curajul fizic si la fel de necesar.",
      "en": "Courage is not the absence of fear, but the conscious choice to act despite it. It is the capacity to move forward when everything in you wants to retreat. Emotional courage — being vulnerable, speaking the truth, asking for help — is often more difficult than physical courage and equally necessary."
    },
    "needs": {
      "ro": "sustinere si spatiu de actiune",
      "en": "support and space to act"
    }
  },
  "creative": {
    "id": "creative",
    "label": {
      "ro": "Creativ",
      "en": "Creative"
    },
    "color": "#FFF0A0",
    "level": 2,
    "parent": "powerful",
    "description": {
      "ro": "Creativitatea este capacitatea de a vedea conexiuni noi si de a genera ceva care nu exista inca. Este expresia libertatii interioare si a jocului cu posibilitati. Starea creativa apare cand te simti suficient de sigur pentru a risca esecul si suficient de curios pentru a explora necunoscutul. Creativitatea nu este un talent rar, ci o capacitate umana universala.",
      "en": "Creativity is the capacity to see new connections and generate something that doesn't yet exist. It is the expression of inner freedom and the play with possibilities. The creative state arises when you feel safe enough to risk failure and curious enough to explore the unknown. Creativity is not a rare talent, but a universal human capacity."
    },
    "needs": {
      "ro": "inspiratie si libertate de a experimenta",
      "en": "inspiration and freedom to experiment"
    }
  },
  "determined": {
    "id": "determined",
    "label": {
      "ro": "Hotarat",
      "en": "Determined"
    },
    "color": "#FFF0A0",
    "level": 2,
    "parent": "powerful",
    "description": {
      "ro": "Hotararea este forta volitiva care te tine pe drum cand obstacolele apar — o rezolvare interioara clara si neclintita de a continua, indiferent de dificultati. Nu este rigiditate, ci angajament constient fata de un scop care conteaza cu adevarat pentru tine. Hotararea sanatoasa include si flexibilitatea de a-ti ajusta metoda, nu doar tenacitatea de a persista.",
      "en": "Determination is the volitional force that keeps you on course when obstacles appear — a clear and unwavering inner resolve to continue regardless of difficulty. It is not rigidity, but conscious commitment to a goal that truly matters to you. Healthy determination also includes the flexibility to adjust your method, not just the tenacity to persist."
    },
    "needs": {
      "ro": "claritate si perseverenta",
      "en": "clarity and perseverance"
    }
  },
  "peaceful": {
    "id": "peaceful",
    "label": {
      "ro": "Pasnic",
      "en": "Peaceful"
    },
    "color": "#FFE57F",
    "level": 1,
    "parent": "happy",
    "children": [
      "loving",
      "thankful",
      "relief",
      "harmonious"
    ],
    "description": {
      "ro": "Pacea interioara este starea in care conflictele interne s-au calmat si te simti in armonie cu tine insuti si cu lumea. Nu este o stare pasiva, ci o prezenta activa si constienta. Pacea apare cand renunti la lupta cu realitatea si gasesti un echilibru intre acceptare si actiune. Este fundamentul bunastarii durabile.",
      "en": "Inner peace is the state where internal conflicts have calmed and you feel in harmony with yourself and the world. It is not a passive state, but an active and conscious presence. Peace arises when you stop fighting reality and find a balance between acceptance and action. It is the foundation of lasting wellbeing."
    },
    "needs": {
      "ro": "armonie si liniste",
      "en": "harmony and quiet"
    }
  },
  "loving": {
    "id": "loving",
    "label": {
      "ro": "Iubitor",
      "en": "Loving"
    },
    "color": "#FFF0A0",
    "level": 2,
    "parent": "peaceful",
    "description": {
      "ro": "A fi iubitor este o stare activa de grija si devotament — nu doar primesti iubire, ci o oferi constient si generos. Este capacitatea de a vedea frumusetea si valoarea celuilalt si de a actiona in consecinta. Starea de iubire te deschide, te face vulnerabil si te conecteaza la ceea ce este cel mai profund uman in tine.",
      "en": "Being loving is an active state of care and devotion — you don't just receive love, but offer it consciously and generously. It is the capacity to see the beauty and value of the other and to act accordingly. The loving state opens you, makes you vulnerable, and connects you to what is most deeply human in you."
    },
    "needs": {
      "ro": "reciprocitate si prezenta",
      "en": "reciprocity and presence"
    }
  },
  "thankful": {
    "id": "thankful",
    "label": {
      "ro": "Recunoscator",
      "en": "Thankful"
    },
    "color": "#FFF0A0",
    "level": 2,
    "parent": "peaceful",
    "description": {
      "ro": "Recunostinta este capacitatea de a recunoaste si aprecia binele din viata ta — de la darurile mari pana la gesturile marunte. Cercetarile arata ca practica recunostintei reduce depresia, imbunatateste somnul si intareste relatiile. Recunostinta autentica nu este o obligatie sociala, ci o deschidere a inimii catre abundenta care exista deja.",
      "en": "Thankfulness is the capacity to recognize and appreciate the good in your life — from great gifts to small gestures. Research shows that gratitude practice reduces depression, improves sleep, and strengthens relationships. Authentic thankfulness is not a social obligation, but an opening of the heart to the abundance that already exists."
    },
    "needs": {
      "ro": "savurare si exprimare",
      "en": "savoring and expression"
    }
  },
  "relief": {
    "id": "relief",
    "label": {
      "ro": "Usurare",
      "en": "Relief"
    },
    "color": "#81C784",
    "level": 2,
    "parent": "peaceful",
    "description": {
      "ro": "Usurarea este eliberarea emotionala care vine dupa ce o amenintare, o tensiune sau o incertitudine a trecut. Este corpul si mintea ta care se relaxeaza dupa o perioada de alerta. Functia adaptiva a usurarii este sa semnaleze ca esti din nou in siguranta si sa permita sistemului nervos sa revina la echilibru, creand spatiu pentru odihna si recuperare.",
      "en": "Relief is the emotional release that comes after a threat, tension, or uncertainty has passed. It is your body and mind relaxing after a period of alertness. The adaptive function of relief is to signal that you are safe again and allow the nervous system to return to balance, creating space for rest and recovery."
    },
    "needs": {
      "ro": "siguranta si odihna",
      "en": "safety and rest"
    }
  },
  "harmonious": {
    "id": "harmonious",
    "label": {
      "ro": "Armonios",
      "en": "Harmonious"
    },
    "color": "#FFF0A0",
    "level": 2,
    "parent": "peaceful",
    "description": {
      "ro": "Armonia interioara este starea in care toate partile tale — gandurile, emotiile, valorile si actiunile — se simt aliniate si coerente. Nu mai exista conflicte interne care sa te traga in directii diferite. Este o pace care vine din integrare, nu din evitare. Armonia nu inseamna absenta complexitatii, ci capacitatea de a tine impreuna toate aspectele experientei tale intr-un echilibru care te sustine.",
      "en": "Inner harmony is the state where all your parts — thoughts, emotions, values, and actions — feel aligned and coherent. There are no longer internal conflicts pulling you in different directions. It is a peace that comes from integration, not avoidance. Harmony does not mean the absence of complexity, but the capacity to hold all aspects of your experience together in a balance that sustains you."
    },
    "needs": {
      "ro": "coerenta si echilibru",
      "en": "coherence and balance"
    }
  },
  "trusting": {
    "id": "trusting",
    "label": {
      "ro": "Incredere",
      "en": "Trusting"
    },
    "color": "#FFE57F",
    "level": 1,
    "parent": "happy",
    "children": [
      "sensitive",
      "intimate",
      "compassion"
    ],
    "description": {
      "ro": "A fi in stare de incredere inseamna sa te simti suficient de sigur pentru a te deschide catre ceilalti si catre viata. Este capacitatea de a te baza pe altii fara a avea nevoie de garantii absolute. Increderea sanatoasa se bazeaza pe experienta, nu pe naivitate, si include capacitatea de a-ti proteja granitele cand este necesar.",
      "en": "Being in a trusting state means feeling safe enough to open yourself to others and to life. It is the capacity to rely on others without needing absolute guarantees. Healthy trusting is based on experience, not naivety, and includes the capacity to protect your boundaries when necessary."
    },
    "needs": {
      "ro": "siguranta si deschidere",
      "en": "safety and openness"
    }
  },
  "sensitive": {
    "id": "sensitive",
    "label": {
      "ro": "Sensibil",
      "en": "Sensitive"
    },
    "color": "#FFF0A0",
    "level": 2,
    "parent": "trusting",
    "description": {
      "ro": "Sensibilitatea este capacitatea de a percepe nuante subtile — ale propriilor emotii, ale celorlalti si ale mediului. Este un dar care aduce profunzime experientei, dar care poate fi si coplesitor. Persoanele sensibile proceseaza informatia mai profund si reactioneaza mai intens. Sensibilitatea necesita ingrijire constienta si granite sanatoase.",
      "en": "Sensitivity is the capacity to perceive subtle nuances — of your own emotions, of others, and of the environment. It is a gift that brings depth to experience, but can also be overwhelming. Sensitive people process information more deeply and react more intensely. Sensitivity requires conscious care and healthy boundaries."
    },
    "needs": {
      "ro": "blandete si limite",
      "en": "gentleness and boundaries"
    }
  },
  "intimate": {
    "id": "intimate",
    "label": {
      "ro": "Intim",
      "en": "Intimate"
    },
    "color": "#FFF0A0",
    "level": 2,
    "parent": "trusting",
    "description": {
      "ro": "Intimitatea este experienta de a fi complet deschis si vulnerabil in prezenta cuiva in care ai incredere totala. Este cea mai profunda forma de conexiune umana — spatiul in care poti fi complet tu insuti fara masca. Intimitatea se construieste lent, prin momente repetate de vulnerabilitate reciproca si raspuns empatic.",
      "en": "Intimacy is the experience of being completely open and vulnerable in the presence of someone you fully trust. It is the deepest form of human connection — the space where you can be completely yourself without a mask. Intimacy is built slowly, through repeated moments of mutual vulnerability and empathic response."
    },
    "needs": {
      "ro": "incredere si vulnerabilitate",
      "en": "trust and vulnerability"
    }
  },
  "compassion": {
    "id": "compassion",
    "label": {
      "ro": "Compasiune",
      "en": "Compassion"
    },
    "color": "#66BB6A",
    "level": 2,
    "parent": "trusting",
    "description": {
      "ro": "Compasiunea este capacitatea de a recunoaste suferinta celuilalt si de a simti un impuls autentic de a ajuta. Este mai mult decat empatie — include si actiunea, dorinta de a alina durerea pe care o percepi. Functia ei adaptiva este sa intareasca legaturile sociale si sa creeze retele de sprijin reciproc, facandu-ne mai rezilienti impreuna decat singuri.",
      "en": "Compassion is the capacity to recognize another's suffering and feel a genuine impulse to help. It is more than empathy — it includes action, the desire to ease the pain you perceive. Its adaptive function is to strengthen social bonds and create networks of mutual support, making us more resilient together than alone."
    },
    "needs": {
      "ro": "exprimare si reciprocitate",
      "en": "expression and reciprocity"
    }
  },
  "optimistic": {
    "id": "optimistic",
    "label": {
      "ro": "Optimist",
      "en": "Optimistic"
    },
    "color": "#FFE57F",
    "level": 1,
    "parent": "happy",
    "children": [
      "inspired",
      "open",
      "hopeful"
    ],
    "description": {
      "ro": "Optimismul este orientarea emotionala catre posibilitati pozitive — convingerea ca lucrurile pot merge bine si ca merita sa incerci. Nu este negarea realitatii, ci o predispozitie de a vedea resursele si oportunitatile chiar si in situatii dificile. Optimismul realist este unul dintre cei mai puternici factori de rezilienta psihologica.",
      "en": "Optimism is the emotional orientation toward positive possibilities — the conviction that things can go well and that it's worth trying. It is not a denial of reality, but a predisposition to see resources and opportunities even in difficult situations. Realistic optimism is one of the most powerful factors of psychological resilience."
    },
    "needs": {
      "ro": "posibilitate si incurajare",
      "en": "possibility and encouragement"
    }
  },
  "inspired": {
    "id": "inspired",
    "label": {
      "ro": "Inspirat",
      "en": "Inspired"
    },
    "color": "#FFF0A0",
    "level": 2,
    "parent": "optimistic",
    "description": {
      "ro": "Inspiratia este momentul in care ceva din exterior aprinde o flacara in interior — simti un elan creativ, o viziune clara sau o motivatie puternica de a actiona. Este emotia care te conecteaza cu un sens mai mare decat tine. Inspiratia nu poate fi fortata, dar poate fi cultivata prin expunerea la frumusete, idei noi si oameni autentici.",
      "en": "Inspiration is the moment when something external ignites a flame within — you feel a creative impulse, a clear vision, or a powerful motivation to act. It is the emotion that connects you to a meaning greater than yourself. Inspiration cannot be forced, but can be cultivated through exposure to beauty, new ideas, and authentic people."
    },
    "needs": {
      "ro": "exprimare creativa si actiune",
      "en": "creative expression and action"
    }
  },
  "open": {
    "id": "open",
    "label": {
      "ro": "Deschis",
      "en": "Open"
    },
    "color": "#FFF0A0",
    "level": 2,
    "parent": "optimistic",
    "description": {
      "ro": "Deschiderea este disponibilitatea de a primi experienta noua fara filtrele obisnuite ale judecatii si prejudecatii. Este o stare de receptivitate in care mintea si inima nu sunt aparate, ci accesibile. Deschiderea iti permite sa inveti, sa te schimbi si sa te conectezi cu diversitatea vietii.",
      "en": "Openness is the willingness to receive new experience without the usual filters of judgment and prejudice. It is a state of receptivity where the mind and heart are not defended, but accessible. Openness allows you to learn, change, and connect with the diversity of life."
    },
    "needs": {
      "ro": "acceptare si experienta noua",
      "en": "acceptance and new experience"
    }
  },
  "hopeful": {
    "id": "hopeful",
    "label": {
      "ro": "Plin de speranta",
      "en": "Hopeful"
    },
    "color": "#FFF0A0",
    "level": 2,
    "parent": "optimistic",
    "description": {
      "ro": "Speranta este credinta linistita ca lucrurile se pot imbunatati — nu o certitudine, ci o deschidere catre posibilitate chiar si atunci cand prezentul este dificil. Este miezul optimismului, resursa interioara care te sustine in perioadele de incertitudine si tranzitie. Speranta nu neaga suferinta prezenta, ci refuza sa o considere permanenta. Cercetarile arata ca speranta este unul dintre cei mai puternici predictori ai rezilientei psihologice.",
      "en": "Hope is the quiet belief that things can improve — not a certainty, but an openness to possibility even when the present is difficult. It is the core of optimism, the inner resource that sustains you through periods of uncertainty and transition. Hope does not deny present suffering, but refuses to consider it permanent. Research shows that hope is one of the strongest predictors of psychological resilience."
    },
    "needs": {
      "ro": "posibilitate si rabdare",
      "en": "possibility and patience"
    }
  }
}
