{
  "despair": {
    "id": "despair",
    "label": {
      "ro": "Disperare",
      "en": "Despair"
    },
    "color": "#9CB8DA",
    "level": 1,
    "parent": "sad",
    "children": [
      "grief",
      "powerless",
      "anguished"
    ],
    "description": {
      "ro": "Disperarea este starea in care speranta pare sa fi disparut complet — viitorul pare inchis si nu mai vezi nicio cale de iesire. Este una dintre cele mai intunecate experiente emotionale umane. Disperarea este un semnal de alarma ca ai nevoie urgenta de conexiune si sprijin. Chiar si in cele mai intunecate momente, o mana intinsa poate face diferenta.",
      "en": "Despair is the state where hope seems to have completely disappeared — the future seems closed and you see no way out. It is one of the darkest human emotional experiences. Despair is an alarm signal that you urgently need connection and support. Even in the darkest moments, an outstretched hand can make the difference."
    },
    "needs": {
      "ro": "conexiune si sustinere imediata",
      "en": "connection and immediate support"
    }
  },
  "grief": {
    "id": "grief",
    "label": {
      "ro": "Doliu",
      "en": "Grief"
    },
    "color": "#B0C8E4",
    "level": 2,
    "parent": "despair",
    "description": {
      "ro": "Doliul este procesul natural de adaptare la o pierdere profunda — moartea cuiva drag, sfarsitul unei relatii sau disparitia unui vis. Doliul nu are un calendar si nu urmeaza etape liniare. Vine in valuri — uneori coplesitoare, alteori calme. A-ti permite doliul este esential pentru vindecare. Nu exista un mod gresit de a suferi.",
      "en": "Grief is the natural process of adapting to a profound loss — the death of someone dear, the end of a relationship, or the disappearance of a dream. Grief has no calendar and doesn't follow linear stages. It comes in waves — sometimes overwhelming, sometimes calm. Allowing yourself to grieve is essential for healing. There is no wrong way to mourn."
    },
    "needs": {
      "ro": "timp, marturisire si permisiunea de a jelui",
      "en": "time, witnessing, and permission to mourn"
    }
  },
  "powerless": {
    "id": "powerless",
    "label": {
      "ro": "Neputincios",
      "en": "Powerless"
    },
    "color": "#B0C8E4",
    "level": 2,
    "parent": "despair",
    "description": {
      "ro": "Neputinta este experienta devastatoare ca nu poti influenta sau schimba o situatie care te face sa suferi. Este opusul agentivitatii — simti ca viata ti se intampla si tu nu ai niciun control. Neputinta invatata este un factor central in depresie. Recuperarea incepe cu identificarea oricat de mic a unui lucru pe care il poti controla si actionarea asupra lui.",
      "en": "Powerlessness is the devastating experience that you cannot influence or change a situation that causes you suffering. It is the opposite of agency — you feel that life happens to you and you have no control. Learned helplessness is a central factor in depression. Recovery begins with identifying however small a thing you can control and acting on it."
    },
    "needs": {
      "ro": "un pas mic controlabil",
      "en": "one small controllable step"
    }
  },
  "anguished": {
    "id": "anguished",
    "label": {
      "ro": "Chinuit",
      "en": "Anguished"
    },
    "color": "#B0C8E4",
    "level": 2,
    "parent": "despair",
    "description": {
      "ro": "Chinul emotional este durerea psihica atat de intensa incat devine fizica — o suferinta bruta, nediferentiata, care pare ca iti rascoleste tot interiorul. Nu poti gandi clar, nu poti functiona, nu poti pune cuvinte pe ceea ce simti. Corpul se incordeaza, respiratia devine grea, si totul pare sa doara in acelasi timp. Chinul este un semnal ca ai fost impins dincolo de capacitatea ta curenta de a face fata — nu este o slabiciune, ci o suprasolicitare a sistemului tau emotional care cere ajutor imediat.",
      "en": "Emotional anguish is psychological pain so intense it becomes physical — a raw, undifferentiated suffering that seems to tear through your entire being. You cannot think clearly, you cannot function, you cannot put words to what you feel. The body tenses, breathing becomes heavy, and everything seems to hurt at once. Anguish is a signal that you have been pushed beyond your current capacity to cope — it is not a weakness, but an overload of your emotional system that calls for immediate help."
    },
    "needs": {
      "ro": "prezenta umana si siguranta imediata",
      "en": "human presence and immediate safety"
    }
  },
  "vulnerable": {
    "id": "vulnerable",
    "label": {
      "ro": "Vulnerabil",
      "en": "Vulnerable"
    },
    "color": "#9CB8DA",
    "level": 1,
    "parent": "sad",
    "children": [
      "fragile",
      "victimized",
      "defenseless"
    ],
    "description": {
      "ro": "Vulnerabilitatea este starea de a fi deschis si expus la potentiala durere. Desi instinctiv cautam sa evitam vulnerabilitatea, cercetarile arata ca este poarta catre intimitate, autenticitate si conexiune profunda. A fi vulnerabil nu inseamna a fi slab — inseamna a avea curajul de a te arata asa cum esti, fara garantia ca vei fi acceptat.",
      "en": "Vulnerability is the state of being open and exposed to potential pain. Though we instinctively seek to avoid vulnerability, research shows it is the gateway to intimacy, authenticity, and deep connection. Being vulnerable doesn't mean being weak — it means having the courage to show yourself as you are, without the guarantee of being accepted."
    },
    "needs": {
      "ro": "siguranta si acceptare",
      "en": "safety and acceptance"
    }
  },
  "fragile": {
    "id": "fragile",
    "label": {
      "ro": "Fragil",
      "en": "Fragile"
    },
    "color": "#B0C8E4",
    "level": 2,
    "parent": "vulnerable",
    "description": {
      "ro": "Fragilitatea este starea in care te simti ca te-ai putea rupe la cel mai mic impact — emotional, psihologic sau relational. Esti intact dar pe muchie. Fragilitatea apare dupa perioade de stres intens, pierdere sau trauma. Nu este slabiciune permanenta, ci o stare temporara care cere grija, rabdare si protejarea constienta a resurselor limitate.",
      "en": "Fragility is the state where you feel you could break at the slightest impact — emotionally, psychologically, or relationally. You are intact but on the edge. Fragility appears after periods of intense stress, loss, or trauma. It is not permanent weakness, but a temporary state that requires care, patience, and conscious protection of limited resources."
    },
    "needs": {
      "ro": "blandete si odihna protejata",
      "en": "gentleness and protected rest"
    }
  },
  "victimized": {
    "id": "victimized",
    "label": {
      "ro": "Victimizat",
      "en": "Victimized"
    },
    "color": "#B0C8E4",
    "level": 2,
    "parent": "vulnerable",
    "description": {
      "ro": "A te simti victimizat este experienta ca ti s-a facut o nedreptate de catre forte mai puternice decat tine. Poate reflecta o realitate obiectiva de abuz sau poate deveni o pozitie existentiala din care refuzi sa iesi. Victimizarea reala merita validare si sprijin. Identitatea de victima permanenta, insa, te blocheaza in neputinta si te impiedica sa iti recastigi puterea.",
      "en": "Feeling victimized is the experience that injustice was done to you by forces more powerful than yourself. It can reflect an objective reality of abuse or can become an existential position you refuse to leave. Real victimization deserves validation and support. Permanent victim identity, however, locks you in helplessness and prevents you from reclaiming your power."
    },
    "needs": {
      "ro": "validare si recapatarea agentivitatii",
      "en": "validation and reclaiming agency"
    }
  },
  "defenseless": {
    "id": "defenseless",
    "label": {
      "ro": "Fara aparare",
      "en": "Defenseless"
    },
    "color": "#B0C8E4",
    "level": 2,
    "parent": "vulnerable",
    "description": {
      "ro": "A te simti fara aparare este experienta de a fi expus fara niciun strat de protectie — mecanismele tale obisnuite de aparare, fie ca sunt rationale, emotionale sau relationale, sunt indisponibile sau epuizate. Nu este fragilitatea de a fi aproape de punctul de rupere, ci senzatia de a fi complet descoperit in fata a ceea ce vine. Aceasta stare apare adesea dupa perioade in care ai fost nevoit sa fii puternic prea mult timp. A recunoaste ca esti fara aparare este un act de onestitate care deschide drumul catre a primi ajutorul de care ai nevoie.",
      "en": "Feeling defenseless is the experience of being exposed without any layer of protection — your usual defense mechanisms, whether rational, emotional, or relational, are unavailable or exhausted. It is not the fragility of being close to a breaking point, but the sensation of being completely uncovered in the face of whatever comes. This state often appears after periods where you had to be strong for too long. Recognizing that you are defenseless is an act of honesty that opens the path to receiving the help you need."
    },
    "needs": {
      "ro": "protectie si sprijin extern",
      "en": "protection and external support"
    }
  },
  "lonely": {
    "id": "lonely",
    "label": {
      "ro": "Singur",
      "en": "Lonely"
    },
    "color": "#9CB8DA",
    "level": 1,
    "parent": "sad",
    "children": [
      "abandoned",
      "isolated",
      "dor",
      "loneliness",
      "nostalgia"
    ],
    "description": {
      "ro": "Singuratatea este durerea de a fi deconectat — nu neaparat de a fi singur fizic, ci de a nu te simti vazut, inteles si conectat emotional. Singuratatea cronica este un factor de risc major pentru sanatate, comparable cu fumatul. Vindecarea singuratatii nu vine din a fi inconjurat de oameni, ci din a avea relatii in care te simti cu adevarat cunoscut.",
      "en": "Loneliness is the pain of being disconnected — not necessarily being physically alone, but not feeling seen, understood, and emotionally connected. Chronic loneliness is a major health risk factor, comparable to smoking. Healing loneliness doesn't come from being surrounded by people, but from having relationships where you feel truly known."
    },
    "needs": {
      "ro": "conexiune si prezenta",
      "en": "connection and presence"
    }
  },
  "abandoned": {
    "id": "abandoned",
    "label": {
      "ro": "Abandonat",
      "en": "Abandoned"
    },
    "color": "#B0C8E4",
    "level": 2,
    "parent": "lonely",
    "description": {
      "ro": "Abandonul este una dintre cele mai profunde rani emotionale — experienta ca cineva esential a plecat si te-a lasat singur cand aveai cea mai mare nevoie. Abandonul din copilarie lasa amprente care se reactiveaza in relatiile adulte. Frica de abandon poate duce la atasament anxios, dependenta sau, paradoxal, la evitarea completa a intimatatii.",
      "en": "Abandonment is one of the deepest emotional wounds — the experience that someone essential left and left you alone when you needed them most. Childhood abandonment leaves imprints that reactivate in adult relationships. Fear of abandonment can lead to anxious attachment, dependency, or paradoxically, complete avoidance of intimacy."
    },
    "needs": {
      "ro": "atasament sigur si legaturi reparatorii",
      "en": "safe attachment and reparative bonds"
    }
  },
  "isolated": {
    "id": "isolated",
    "label": {
      "ro": "Izolat",
      "en": "Isolated"
    },
    "color": "#B0C8E4",
    "level": 2,
    "parent": "lonely",
    "description": {
      "ro": "Izolarea este starea de separare completa de ceilalti — nu doar fizica, ci si emotionala si existentiala. Te simti singur intr-un mod care pare permanent si fara scapare. Izolarea cronica este una dintre cele mai mari amenintari la sanatatea mentala si fizica. Drumul inapoi catre conexiune incepe cu un singur pas — un mesaj, un apel, o mana intinsa.",
      "en": "Isolation is the state of complete separation from others — not just physical, but emotional and existential. You feel alone in a way that seems permanent and without escape. Chronic isolation is one of the greatest threats to mental and physical health. The road back to connection begins with a single step — a message, a call, an outstretched hand."
    },
    "needs": {
      "ro": "un pas mic catre conexiune",
      "en": "one small step toward connection"
    }
  },
  "dor": {
    "id": "dor",
    "label": {
      "ro": "Dor",
      "en": "Longing (dor)"
    },
    "color": "#7E57C2",
    "level": 2,
    "parent": "lonely",
    "description": {
      "ro": "Dorul este un concept emotional profund romanesc — un amestec dulce-amar de iubire, tristete si speranta indreptate catre cineva sau ceva absent. Dorul te conecteaza cu ceea ce conteaza cel mai mult pentru tine, chiar cand acel lucru este departe. Functia lui adaptiva este sa pastreze vie legatura interioara cu persoanele, locurile si momentele care ti-au modelat identitatea.",
      "en": "Dor is a deeply Romanian emotional concept — a bittersweet blend of love, sadness, and hope directed toward someone or something absent. It connects you to what matters most, even when that thing is far away. Its adaptive function is to keep alive the inner bond with the people, places, and moments that have shaped your identity."
    },
    "needs": {
      "ro": "recunoastere si conexiune",
      "en": "acknowledgment and connection"
    }
  },
  "loneliness": {
    "id": "loneliness",
    "label": {
      "ro": "Singuratate",
      "en": "Loneliness"
    },
    "color": "#5C6BC0",
    "level": 2,
    "parent": "lonely",
    "description": {
      "ro": "Singuratatea este semnalul emotional ca nevoia ta fundamentala de apartenenta si conexiune autentica nu este implinita. Spre deosebire de izolare, singuratatea poate aparea chiar si in mijlocul multimii — este despre calitatea legaturilor, nu despre cantitate. Functia ei adaptiva este sa te motiveze sa cauti relatii autentice si sa investesti in legaturi care iti hranesc sufletul.",
      "en": "Loneliness is the emotional signal that your fundamental need for belonging and authentic connection is unmet. Unlike isolation, loneliness can arise even in a crowd — it is about the quality of bonds, not quantity. Its adaptive function is to motivate you to seek genuine relationships and invest in connections that nourish your soul."
    },
    "needs": {
      "ro": "conexiune autentica si apartenenta",
      "en": "authentic connection and belonging"
    }
  },
  "nostalgia": {
    "id": "nostalgia",
    "label": {
      "ro": "Nostalgie",
      "en": "Nostalgia"
    },
    "color": "#AB47BC",
    "level": 2,
    "parent": "lonely",
    "description": {
      "ro": "Nostalgia este o emotie dulce-amara care te transporta in momente semnificative din trecut — nu pentru a fugi de prezent, ci pentru a regasi un sentiment de continuitate si sens. Cercetarile arata ca nostalgia contracareaza singuratatea si intareste sentimentul de identitate. Functia ei adaptiva este sa iti reaminteasca cine esti si de unde vii, oferindu-ti resurse emotionale pentru prezent.",
      "en": "Nostalgia is a bittersweet emotion that transports you to meaningful moments from the past — not to escape the present, but to rediscover a sense of continuity and meaning. Research shows nostalgia counteracts loneliness and strengthens the sense of identity. Its adaptive function is to remind you who you are and where you come from, providing emotional resources for the present."
    },
    "needs": {
      "ro": "sens si continuitate",
      "en": "meaning and continuity"
    }
  }
}
